// ============================================================
// 函数名称: sub_576610
// 起始地址: 0x576610
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00576610    push esi
00576611    mov esi, ecx
00576613    call 0x00576630                                 ; => [ Call: sub_576630 ]
00576618    test byte ptr ss:[esp+0x08], 0x01
0057661D    jz 0x00576628
0057661F    push esi
00576620    call 0x0069AD76                                 ; => [ Call: j__free ]
00576625    add esp, 0x04
00576628    mov eax, esi
0057662A    pop esi
0057662B    ret 0x04
