// ============================================================
// 函数名称: sub_401410
// 起始地址: 0x401410
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00401410    push 0x00
00401412    push 0x6DA1CF
00401417    mov ecx, 0x74F5E4
0040141C    call 0x00402110                                 ; => [ Data: data_74f5e4 | Call: nullptr | Call: sub_402110 ]
00401421    push 0x6D1FC0
00401426    call 0x0069AD3F
0040142B    pop ecx
0040142C    ret                                             ; => [ Call: sub_6d1fc0 | Call: _atexit ]
