// ============================================================
// 函数名称: sub_58285a
// 起始地址: 0x58285a
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

0058285A    mov ecx, dword ptr ss:[ebp-0x14]
0058285D    call 0x00435C20                                 ; => [ Call: sub_435c20 ]
00582862    push 0x00
00582864    push 0x00
00582866    call 0x0069DF2B                                 ; => [ Call: sub_69df2b | Call: nullptr ]
