// ============================================================
// 函数名称: sub_474970
// 起始地址: 0x474970
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00474970    push esi
00474971    mov esi, ecx
00474973    call 0x00474990                                 ; => [ Call: sub_474990 ]
00474978    test byte ptr ss:[esp+0x08], 0x01
0047497D    jz 0x00474988
0047497F    push esi
00474980    call 0x0069AD76                                 ; => [ Call: j__free ]
00474985    add esp, 0x04
00474988    mov eax, esi
0047498A    pop esi
0047498B    ret 0x04
