// ============================================================
// 函数名称: sub_663220
// 起始地址: 0x663220
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00663220    push esi
00663221    mov esi, ecx
00663223    call 0x00663240                                 ; => [ Call: sub_663240 ]
00663228    test byte ptr ss:[esp+0x08], 0x01
0066322D    jz 0x00663238
0066322F    push esi
00663230    call 0x0069AD76                                 ; => [ Call: j__free ]
00663235    add esp, 0x04
00663238    mov eax, esi
0066323A    pop esi
0066323B    ret 0x04
