// ============================================================
// 函数名称: sub_534040
// 起始地址: 0x534040
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00534040    push esi
00534041    mov esi, ecx
00534043    call 0x00534060                                 ; => [ Call: sub_534060 ]
00534048    test byte ptr ss:[esp+0x08], 0x01
0053404D    jz 0x00534058
0053404F    push esi
00534050    call 0x0069AD76                                 ; => [ Call: j__free ]
00534055    add esp, 0x04
00534058    mov eax, esi
0053405A    pop esi
0053405B    ret 0x04
