// ============================================================
// 函数名称: sub_576470
// 起始地址: 0x576470
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00576470    push esi
00576471    mov esi, ecx
00576473    call 0x00576490                                 ; => [ Call: sub_576490 ]
00576478    test byte ptr ss:[esp+0x08], 0x01
0057647D    jz 0x00576488
0057647F    push esi
00576480    call 0x0069AD76                                 ; => [ Call: j__free ]
00576485    add esp, 0x04
00576488    mov eax, esi
0057648A    pop esi
0057648B    ret 0x04
