// ============================================================
// 函数名称: sub_5865fd
// 起始地址: 0x5865fd
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

005865FD    push dword ptr ss:[ebp-0x18]
00586600    call 0x0069AD76                                 ; => [ Call: j__free ]
00586605    add esp, 0x04
00586608    push 0x00
0058660A    push 0x00
0058660C    call 0x0069DF2B                                 ; => [ Call: sub_69df2b | Call: nullptr ]
