// ============================================================
// 函数名称: sub_473380
// 起始地址: 0x473380
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00473380    push esi
00473381    mov esi, ecx
00473383    call 0x004733A0                                 ; => [ Call: sub_4733a0 ]
00473388    test byte ptr ss:[esp+0x08], 0x01
0047338D    jz 0x00473398
0047338F    push esi
00473390    call 0x0069AD76                                 ; => [ Call: j__free ]
00473395    add esp, 0x04
00473398    mov eax, esi
0047339A    pop esi
0047339B    ret 0x04
