// ============================================================
// 函数名称: sub_619be9
// 起始地址: 0x619be9
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00619BE9    mov ecx, dword ptr ss:[ebp-0x14]
00619BEC    call 0x00619C10                                 ; => [ Call: sub_619c10 ]
00619BF1    push 0x00
00619BF3    push 0x00
00619BF5    call 0x0069DF2B                                 ; => [ Call: sub_69df2b | Call: nullptr ]
