// ============================================================
// 函数名称: sub_5916f0
// 起始地址: 0x5916f0
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

005916F0    push esi
005916F1    mov esi, ecx
005916F3    call 0x00590860                                 ; => [ Call: sub_590860 ]
005916F8    test byte ptr ss:[esp+0x08], 0x01
005916FD    jz 0x00591708
005916FF    push esi
00591700    call 0x0069AD76                                 ; => [ Call: j__free ]
00591705    add esp, 0x04
00591708    mov eax, esi
0059170A    pop esi
0059170B    ret 0x04
