// ============================================================
// 函数名称: sub_4854b0
// 起始地址: 0x4854b0
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

004854B0    push 0x00
004854B2    push dword ptr ss:[esp+0x14]
004854B6    add ecx, 0x04
004854B9    push dword ptr ss:[esp+0x14]
004854BD    push dword ptr ss:[esp+0x14]
004854C1    call 0x00485A30
004854C6    ret 0x10                                        ; => [ Call: sub_485a30 ]
