// ============================================================
// 函数名称: sub_491730
// 起始地址: 0x491730
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00491730    push esi
00491731    mov esi, ecx
00491733    call 0x00491750                                 ; => [ Call: sub_491750 ]
00491738    test byte ptr ss:[esp+0x08], 0x01
0049173D    jz 0x00491748
0049173F    push esi
00491740    call 0x0069AD76                                 ; => [ Call: j__free ]
00491745    add esp, 0x04
00491748    mov eax, esi
0049174A    pop esi
0049174B    ret 0x04
