// ============================================================
// 函数名称: sub_401310
// 起始地址: 0x401310
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00401310    push 0x00
00401312    push 0x6DA092
00401317    mov ecx, 0x74F53C
0040131C    call 0x00402110                                 ; => [ Data: data_74f53c | Call: sub_402110 | Call: nullptr ]
00401321    push 0x6D1C70
00401326    call 0x0069AD3F
0040132B    pop ecx
0040132C    ret                                             ; => [ Call: sub_6d1c70 | Call: _atexit ]
