// ============================================================
// 函数名称: sub_591730
// 起始地址: 0x591730
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00591730    push esi
00591731    mov esi, ecx
00591733    call 0x005911A0                                 ; => [ Call: sub_5911a0 ]
00591738    test byte ptr ss:[esp+0x08], 0x01
0059173D    jz 0x00591748
0059173F    push esi
00591740    call 0x0069AD76                                 ; => [ Call: j__free ]
00591745    add esp, 0x04
00591748    mov eax, esi
0059174A    pop esi
0059174B    ret 0x04
