// ============================================================
// 函数名称: sub_401550
// 起始地址: 0x401550
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00401550    push 0x00
00401552    push 0x6DA25B
00401557    mov ecx, 0x74F6D4
0040155C    call 0x00402110                                 ; => [ Data: data_74f6d4 | Call: nullptr | Call: sub_402110 ]
00401561    push 0x6D2380
00401566    call 0x0069AD3F
0040156B    pop ecx
0040156C    ret                                             ; => [ Call: sub_6d2380 | Call: _atexit ]
