// ============================================================
// 函数名称: sub_4d926d
// 起始地址: 0x4d926d
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

004D926D    mov ecx, dword ptr ss:[ebp-0x18]
004D9270    call 0x004D87C0                                 ; => [ Call: sub_4d87c0 ]
004D9275    push 0x00
004D9277    push 0x00
004D9279    call 0x0069DF2B                                 ; => [ Call: sub_69df2b | Call: nullptr ]
