// ============================================================
// 函数名称: sub_479280
// 起始地址: 0x479280
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00479280    push esi
00479281    mov esi, ecx
00479283    call 0x004792A0                                 ; => [ Call: sub_4792a0 ]
00479288    test byte ptr ss:[esp+0x08], 0x01
0047928D    jz 0x00479298
0047928F    push esi
00479290    call 0x0069AD76                                 ; => [ Call: j__free ]
00479295    add esp, 0x04
00479298    mov eax, esi
0047929A    pop esi
0047929B    ret 0x04
