// ============================================================
// 函数名称: sub_4704c6
// 起始地址: 0x4704c6
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

004704C6    push dword ptr ss:[ebp+0x14]
004704C9    call 0x0069AD76                                 ; => [ Call: j__free ]
004704CE    add esp, 0x04
004704D1    push 0x00
004704D3    push 0x00
004704D5    call 0x0069DF2B                                 ; => [ Call: sub_69df2b | Call: nullptr ]
