// ============================================================
// 函数名称: sub_401750
// 起始地址: 0x401750
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00401750    push 0x00
00401752    push 0x6DA5DD
00401757    mov ecx, 0x74F854
0040175C    call 0x00402110                                 ; => [ Data: data_74f854 | Call: nullptr | Call: sub_402110 ]
00401761    push 0x6D2980
00401766    call 0x0069AD3F
0040176B    pop ecx
0040176C    ret                                             ; => [ Call: sub_6d2980 | Call: _atexit ]
