// ============================================================
// 函数名称: sub_539aa9
// 起始地址: 0x539aa9
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00539AA9    mov ecx, dword ptr ss:[ebp-0x18]
00539AAC    call 0x00539B90                                 ; => [ Call: sub_539b90 ]
00539AB1    push 0x00
00539AB3    push 0x00
00539AB5    call 0x0069DF2B                                 ; => [ Call: sub_69df2b | Call: nullptr ]
