// ============================================================
// 函数名称: sub_449740
// 起始地址: 0x449740
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00449740    push esi
00449741    mov esi, ecx
00449743    call 0x00449760                                 ; => [ Call: sub_449760 ]
00449748    test byte ptr ss:[esp+0x08], 0x01
0044974D    jz 0x00449758
0044974F    push esi
00449750    call 0x0069AD76                                 ; => [ Call: j__free ]
00449755    add esp, 0x04
00449758    mov eax, esi
0044975A    pop esi
0044975B    ret 0x04
