// ============================================================
// 函数名称: sub_428082
// 起始地址: 0x428082
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00428082    push dword ptr ss:[ebp-0x14]
00428085    call 0x0069AD76                                 ; => [ Call: j__free ]
0042808A    add esp, 0x04
0042808D    push 0x00
0042808F    push 0x00
00428091    call 0x0069DF2B                                 ; => [ Call: sub_69df2b | Call: nullptr ]
