// ============================================================
// 函数名称: sub_586930
// 起始地址: 0x586930
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00586930    push esi
00586931    mov esi, ecx
00586933    call 0x00586BB0                                 ; => [ Call: sub_586bb0 ]
00586938    test byte ptr ss:[esp+0x08], 0x01
0058693D    jz 0x00586948
0058693F    push esi
00586940    call 0x0069AD76                                 ; => [ Call: j__free ]
00586945    add esp, 0x04
00586948    mov eax, esi
0058694A    pop esi
0058694B    ret 0x04
