// ============================================================
// 函数名称: sub_60a412
// 起始地址: 0x60a412
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

0060A412    mov ecx, dword ptr ss:[ebp-0x14]
0060A415    call 0x0060A4B0                                 ; => [ Call: sub_60a4b0 ]
0060A41A    push 0x00
0060A41C    push 0x00
0060A41E    call 0x0069DF2B                                 ; => [ Call: sub_69df2b | Call: nullptr ]
