// ============================================================
// 函数名称: sub_484f71
// 起始地址: 0x484f71
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00484F71    mov ecx, dword ptr ss:[ebp-0x18]
00484F74    call 0x004813F0                                 ; => [ Call: sub_4813f0 ]
00484F79    push 0x00
00484F7B    push 0x00
00484F7D    call 0x0069DF2B                                 ; => [ Call: sub_69df2b | Call: nullptr ]
