// ============================================================
// 函数名称: sub_468e90
// 起始地址: 0x468e90
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00468E90    cmp byte ptr ss:[esp+0x04], 0x00
00468E95    lea eax, ss:[esp+0x04]
00468E99    push eax
00468E9A    setnz byte ptr ss:[esp+0x08]
00468E9F    add ecx, 0x04
00468EA2    call 0x00414B60
00468EA7    ret 0x04                                        ; => [ Call: sub_414b60 ]
