// ============================================================
// 函数名称: sub_65229b
// 起始地址: 0x65229b
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

0065229B    push dword ptr ss:[ebp-0x18]
0065229E    call 0x0069AD76                                 ; => [ Call: j__free ]
006522A3    add esp, 0x04
006522A6    push 0x00
006522A8    push 0x00
006522AA    call 0x0069DF2B                                 ; => [ Call: sub_69df2b | Call: nullptr ]
