// ============================================================
// 函数名称: sub_650630
// 起始地址: 0x650630
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00650630    push esi
00650631    mov esi, ecx
00650633    call 0x00650650                                 ; => [ Call: sub_650650 ]
00650638    test byte ptr ss:[esp+0x08], 0x01
0065063D    jz 0x00650648
0065063F    push esi
00650640    call 0x0069AD76                                 ; => [ Call: j__free ]
00650645    add esp, 0x04
00650648    mov eax, esi
0065064A    pop esi
0065064B    ret 0x04
