// ============================================================
// 函数名称: sub_401850
// 起始地址: 0x401850
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00401850    push 0x00
00401852    push 0x6DA65D
00401857    mov ecx, 0x74F944
0040185C    call 0x00402110                                 ; => [ Call: nullptr | Call: sub_402110 | Data: data_74f944 ]
00401861    push 0x6D2C80
00401866    call 0x0069AD3F
0040186B    pop ecx
0040186C    ret                                             ; => [ Call: sub_6d2c80 | Call: _atexit ]
