// ============================================================
// 函数名称: sub_421030
// 起始地址: 0x421030
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00421030    mov eax, dword ptr ds:[ecx]
00421032    cmp eax, 0x0E
00421035    jl 0x0042103C
00421037    cmp eax, 0x11
0042103A    jle 0x0042105D
0042103C    cmp eax, 0x16
0042103F    jl 0x00421046
00421041    cmp eax, 0x19
00421044    jle 0x0042105D
00421046    cmp eax, 0x1E
00421049    jz 0x0042105D
0042104B    cmp eax, 0x20
0042104E    jz 0x0042105D
00421050    cmp eax, 0x32
00421053    jz 0x0042105D
00421055    cmp eax, 0x34
00421058    jz 0x0042105D
0042105A    xor al, al
0042105C    ret
0042105D    mov al, 0x01
0042105F    ret
