// ============================================================
// 函数名称: sub_401490
// 起始地址: 0x401490
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00401490    push 0x00
00401492    push 0x6DA247
00401497    mov ecx, 0x74F644
0040149C    call 0x00402110                                 ; => [ Data: data_74f644 | Call: nullptr | Call: sub_402110 ]
004014A1    push 0x6D2140
004014A6    call 0x0069AD3F
004014AB    pop ecx
004014AC    ret                                             ; => [ Call: sub_6d2140 | Call: _atexit ]
