// ============================================================
// 函数名称: sub_495400
// 起始地址: 0x495400
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00495400    push esi
00495401    mov esi, ecx
00495403    call 0x00495420                                 ; => [ Call: sub_495420 ]
00495408    test byte ptr ss:[esp+0x08], 0x01
0049540D    jz 0x00495418
0049540F    push esi
00495410    call 0x0069AD76                                 ; => [ Call: j__free ]
00495415    add esp, 0x04
00495418    mov eax, esi
0049541A    pop esi
0049541B    ret 0x04
