// ============================================================
// 函数名称: sub_579afa
// 起始地址: 0x579afa
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00579AFA    mov ecx, dword ptr ss:[ebp-0x14]
00579AFD    call 0x00578B90                                 ; => [ Call: sub_578b90 ]
00579B02    push 0x00
00579B04    push 0x00
00579B06    call 0x0069DF2B                                 ; => [ Call: sub_69df2b | Call: nullptr ]
