// ============================================================
// 函数名称: sub_68721b
// 起始地址: 0x68721b
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

0068721B    push dword ptr ss:[ebp-0x18]
0068721E    call 0x0069AD76                                 ; => [ Call: j__free ]
00687223    add esp, 0x04
00687226    push 0x00
00687228    push 0x00
0068722A    call 0x0069DF2B                                 ; => [ Call: sub_69df2b | Call: nullptr ]
