// ============================================================
// 函数名称: sub_4567f0
// 起始地址: 0x4567f0
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

004567F0    push esi
004567F1    mov esi, ecx
004567F3    call 0x00456810                                 ; => [ Call: sub_456810 ]
004567F8    test byte ptr ss:[esp+0x08], 0x01
004567FD    jz 0x00456808
004567FF    push esi
00456800    call 0x0069AD76                                 ; => [ Call: j__free ]
00456805    add esp, 0x04
00456808    mov eax, esi
0045680A    pop esi
0045680B    ret 0x04
