// ============================================================
// 函数名称: sub_4784fd
// 起始地址: 0x4784fd
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

004784FD    push dword ptr ss:[ebp+0x14]
00478500    call 0x0069AD76                                 ; => [ Call: j__free ]
00478505    add esp, 0x04
00478508    push 0x00
0047850A    push 0x00
0047850C    call 0x0069DF2B                                 ; => [ Call: sub_69df2b | Call: nullptr ]
