// ============================================================
// 函数名称: sub_485430
// 起始地址: 0x485430
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00485430    push ecx
00485431    push dword ptr ss:[esp+0x14]
00485435    add ecx, 0x04
00485438    push dword ptr ss:[esp+0x14]
0048543C    push dword ptr ss:[esp+0x14]
00485440    call 0x00485890
00485445    ret 0x10                                        ; => [ Call: sub_485890 ]
