// ============================================================
// 函数名称: sub_44177a
// 起始地址: 0x44177a
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

0044177A    mov ecx, dword ptr ss:[ebp-0x14]
0044177D    call 0x0043FB20                                 ; => [ Call: sub_43fb20 ]
00441782    push 0x00
00441784    push 0x00
00441786    call 0x0069DF2B                                 ; => [ Call: sub_69df2b | Call: nullptr ]
