// ============================================================
// 函数名称: sub_579014
// 起始地址: 0x579014
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00579014    mov ecx, dword ptr ss:[ebp-0x14]
00579017    call 0x00435C20                                 ; => [ Call: sub_435c20 ]
0057901C    push 0x00
0057901E    push 0x00
00579020    call 0x0069DF2B                                 ; => [ Call: sub_69df2b | Call: nullptr ]
