// ============================================================
// 函数名称: sub_401390
// 起始地址: 0x401390
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00401390    push 0x00
00401392    push 0x6DA127
00401397    mov ecx, 0x74F5B4
0040139C    call 0x00402110                                 ; => [ Data: data_74f5b4 | Call: nullptr | Call: sub_402110 ]
004013A1    push 0x6D1DF0
004013A6    call 0x0069AD3F
004013AB    pop ecx
004013AC    ret                                             ; => [ Call: sub_6d1df0 | Call: _atexit ]
