// ============================================================
// 函数名称: sub_453724
// 起始地址: 0x453724
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00453724    mov ecx, dword ptr ss:[ebp-0x14]
00453727    call 0x00453870                                 ; => [ Call: sub_453870 ]
0045372C    push 0x00
0045372E    push 0x00
00453730    call 0x0069DF2B                                 ; => [ Call: sub_69df2b | Call: nullptr ]
