// ============================================================
// 函数名称: sub_4019d0
// 起始地址: 0x4019d0
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

004019D0    call 0x004203C0
004019D5    push 0x6D3160
004019DA    mov dword ptr ds:[0x0075DD14], eax              ; => [ Data: data_75dd14 | Call: sub_4203c0 ]
004019DF    call 0x0069AD3F
004019E4    pop ecx
004019E5    ret                                             ; => [ Call: _atexit ]
