// ============================================================
// 函数名称: sub_4854d0
// 起始地址: 0x4854d0
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

004854D0    push 0x00
004854D2    push dword ptr ss:[esp+0x14]
004854D6    add ecx, 0x04
004854D9    push dword ptr ss:[esp+0x14]
004854DD    push dword ptr ss:[esp+0x14]
004854E1    call 0x00485A80
004854E6    ret 0x10                                        ; => [ Call: sub_485a80 ]
