// ============================================================
// 函数名称: sub_515650
// 起始地址: 0x515650
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00515650    push esi
00515651    mov esi, ecx
00515653    call 0x00515670                                 ; => [ Call: sub_515670 ]
00515658    test byte ptr ss:[esp+0x08], 0x01
0051565D    jz 0x00515668
0051565F    push esi
00515660    call 0x0069AD76                                 ; => [ Call: j__free ]
00515665    add esp, 0x04
00515668    mov eax, esi
0051566A    pop esi
0051566B    ret 0x04
