// ============================================================
// 函数名称: sub_470570
// 起始地址: 0x470570
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00470570    push esi
00470571    mov esi, ecx
00470573    call 0x004705B0                                 ; => [ Call: sub_4705b0 ]
00470578    test byte ptr ss:[esp+0x08], 0x01
0047057D    jz 0x00470588
0047057F    push esi
00470580    call 0x0069AD76                                 ; => [ Call: j__free ]
00470585    add esp, 0x04
00470588    mov eax, esi
0047058A    pop esi
0047058B    ret 0x04
