// ============================================================
// 函数名称: sub_591710
// 起始地址: 0x591710
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00591710    push esi
00591711    mov esi, ecx
00591713    call 0x00590E40                                 ; => [ Call: sub_590e40 ]
00591718    test byte ptr ss:[esp+0x08], 0x01
0059171D    jz 0x00591728
0059171F    push esi
00591720    call 0x0069AD76                                 ; => [ Call: j__free ]
00591725    add esp, 0x04
00591728    mov eax, esi
0059172A    pop esi
0059172B    ret 0x04
