// ============================================================
// 函数名称: sub_580040
// 起始地址: 0x580040
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00580040    push esi
00580041    mov esi, dword ptr ss:[esp+0x08]
00580045    lea ecx, ds:[esi+0x14]
00580048    call 0x00580580                                 ; => [ Call: sub_580580 ]
0058004D    push esi
0058004E    call 0x0069AD76
00580053    add esp, 0x04
00580056    pop esi
00580057    ret 0x04                                        ; => [ Call: j__free ]
