// ============================================================
// 函数名称: __exit
// 起始地址: 0x69d06f
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

0069D06F    push ebp
0069D070    mov ebp, esp
0069D072    push 0x00
0069D074    push 0x01
0069D076    push dword ptr ss:[ebp+0x08]
0069D079    call 0x0069D125                                 ; => [ Call: _doexit ]
0069D07E    add esp, 0x0C
0069D081    pop ebp
0069D082    ret
