// ============================================================
// 函数名称: sub_401650
// 起始地址: 0x401650
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00401650    push 0x00
00401652    push 0x6DA517
00401657    mov ecx, 0x74F794
0040165C    call 0x00402110                                 ; => [ Data: data_74f794 | Call: nullptr | Call: sub_402110 ]
00401661    push 0x6D2680
00401666    call 0x0069AD3F
0040166B    pop ecx
0040166C    ret                                             ; => [ Call: sub_6d2680 | Call: _atexit ]
