// ============================================================
// 函数名称: sub_4269c0
// 起始地址: 0x4269c0
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

004269C0    push esi
004269C1    mov esi, ecx
004269C3    call 0x00426FD0                                 ; => [ Call: sub_426fd0 ]
004269C8    lea ecx, ds:[esi+0x6F0]
004269CE    call 0x004315F0                                 ; => [ Call: sub_4315f0 ]
004269D3    xor eax, eax
004269D5    pop esi
004269D6    ret 0x0C
