// ============================================================
// 函数名称: sub_401630
// 起始地址: 0x401630
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00401630    push 0x00
00401632    push 0x6DA503
00401637    mov ecx, 0x74F7AC
0040163C    call 0x00402110                                 ; => [ Call: nullptr | Call: sub_402110 | Data: data_74f7ac ]
00401641    push 0x6D2620
00401646    call 0x0069AD3F
0040164B    pop ecx
0040164C    ret                                             ; => [ Call: sub_6d2620 | Call: _atexit ]
