// ============================================================
// 函数名称: sub_550120
// 起始地址: 0x550120
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00550120    push esi
00550121    mov esi, dword ptr ss:[esp+0x08]
00550125    lea ecx, ds:[esi+0x10]
00550128    call 0x005514E0                                 ; => [ Call: sub_5514e0 ]
0055012D    push esi
0055012E    call 0x0069AD76
00550133    add esp, 0x04
00550136    pop esi
00550137    ret 0x04                                        ; => [ Call: j__free ]
