// ============================================================
// 函数名称: sub_549000
// 起始地址: 0x549000
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00549000    cmp byte ptr ds:[ecx+0x5C], 0x00
00549004    jz 0x00549009
00549006    mov al, 0x01
00549008    ret
00549009    movss xmm0, dword ptr ds:[ecx+0xB0]
00549011    ucomiss xmm0, dword ptr ds:[0x00709014]
00549018    lahf
00549019    test ah, 0x44
0054901C    jp 0x00549006
0054901E    xor al, al
00549020    ret
