// ============================================================
// 函数名称: sub_52943f
// 起始地址: 0x52943f
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

0052943F    mov ecx, dword ptr ss:[ebp-0x14]
00529442    call 0x004B4D00                                 ; => [ Call: sub_4b4d00 ]
00529447    push 0x00
00529449    push 0x00
0052944B    call 0x0069DF2B                                 ; => [ Call: sub_69df2b | Call: nullptr ]
