// ============================================================
// 函数名称: sub_681010
// 起始地址: 0x681010
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00681010    push esi
00681011    mov esi, ecx
00681013    call 0x00681030                                 ; => [ Call: sub_681030 ]
00681018    test byte ptr ss:[esp+0x08], 0x01
0068101D    jz 0x00681028
0068101F    push esi
00681020    call 0x0069AD76                                 ; => [ Call: j__free ]
00681025    add esp, 0x04
00681028    mov eax, esi
0068102A    pop esi
0068102B    ret 0x04
