// ============================================================
// 函数名称: sub_4014d0
// 起始地址: 0x4014d0
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

004014D0    push 0x00
004014D2    push 0x6DA24F
004014D7    mov ecx, 0x74F674
004014DC    call 0x00402110                                 ; => [ Call: nullptr | Call: sub_402110 | Data: data_74f674 ]
004014E1    push 0x6D2200
004014E6    call 0x0069AD3F
004014EB    pop ecx
004014EC    ret                                             ; => [ Call: sub_6d2200 | Call: _atexit ]
