// ============================================================
// 函数名称: sub_401670
// 起始地址: 0x401670
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00401670    push 0x00
00401672    push 0x6DA527
00401677    mov ecx, 0x74F7DC
0040167C    call 0x00402110                                 ; => [ Data: data_74f7dc | Call: nullptr | Call: sub_402110 ]
00401681    push 0x6D26E0
00401686    call 0x0069AD3F
0040168B    pop ecx
0040168C    ret                                             ; => [ Call: sub_6d26e0 | Call: _atexit ]
