// ============================================================
// 函数名称: sub_485630
// 起始地址: 0x485630
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00485630    push esi
00485631    mov esi, ecx
00485633    call 0x00485650                                 ; => [ Call: sub_485650 ]
00485638    test byte ptr ss:[esp+0x08], 0x01
0048563D    jz 0x00485648
0048563F    push esi
00485640    call 0x0069AD76                                 ; => [ Call: j__free ]
00485645    add esp, 0x04
00485648    mov eax, esi
0048564A    pop esi
0048564B    ret 0x04
