// ============================================================
// 函数名称: sub_41025c
// 起始地址: 0x41025c
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

0041025C    mov ecx, dword ptr ss:[ebp-0x14]
0041025F    call 0x0040AE30                                 ; => [ Call: sub_40ae30 ]
00410264    push 0x00
00410266    push 0x00
00410268    call 0x0069DF2B                                 ; => [ Call: sub_69df2b | Call: nullptr ]
