// ============================================================
// 函数名称: sub_429980
// 起始地址: 0x429980
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00429980    push esi
00429981    mov esi, ecx
00429983    call 0x004299A0                                 ; => [ Call: sub_4299a0 ]
00429988    test byte ptr ss:[esp+0x08], 0x01
0042998D    jz 0x00429998
0042998F    push esi
00429990    call 0x0069AD76                                 ; => [ Call: j__free ]
00429995    add esp, 0x04
00429998    mov eax, esi
0042999A    pop esi
0042999B    ret 0x04
