// ============================================================
// 函数名称: sub_401830
// 起始地址: 0x401830
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00401830    push 0x00
00401832    push 0x6DA61B
00401837    mov ecx, 0x74F8FC
0040183C    call 0x00402110                                 ; => [ Data: data_74f8fc | Call: sub_402110 | Call: nullptr ]
00401841    push 0x6D2C20
00401846    call 0x0069AD3F
0040184B    pop ecx
0040184C    ret                                             ; => [ Call: sub_6d2c20 | Call: _atexit ]
