// ============================================================
// 函数名称: sub_449080
// 起始地址: 0x449080
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00449080    push esi
00449081    mov esi, ecx
00449083    call 0x004490A0                                 ; => [ Call: sub_4490a0 ]
00449088    test byte ptr ss:[esp+0x08], 0x01
0044908D    jz 0x00449098
0044908F    push esi
00449090    call 0x0069AD76                                 ; => [ Call: j__free ]
00449095    add esp, 0x04
00449098    mov eax, esi
0044909A    pop esi
0044909B    ret 0x04
