// ============================================================
// 函数名称: sub_675100
// 起始地址: 0x675100
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00675100    push esi
00675101    mov esi, ecx
00675103    call 0x00675120                                 ; => [ Call: sub_675120 ]
00675108    test byte ptr ss:[esp+0x08], 0x01
0067510D    jz 0x00675118
0067510F    push esi
00675110    call 0x0069AD76                                 ; => [ Call: j__free ]
00675115    add esp, 0x04
00675118    mov eax, esi
0067511A    pop esi
0067511B    ret 0x04
