// ============================================================
// 函数名称: sub_57978d
// 起始地址: 0x57978d
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

0057978D    push dword ptr ss:[ebp-0x18]
00579790    call 0x0069AD76                                 ; => [ Call: j__free ]
00579795    add esp, 0x04
00579798    push 0x00
0057979A    push 0x00
0057979C    call 0x0069DF2B                                 ; => [ Call: sub_69df2b | Call: nullptr ]
