// ============================================================
// 函数名称: sub_464920
// 起始地址: 0x464920
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00464920    push ecx
00464921    lea edx, ds:[ecx+0x0C]
00464924    mov dword ptr ss:[esp], 0x00
0046492B    mov ecx, dword ptr ss:[esp+0x08]
0046492F    call 0x004591C0                                 ; => [ Call: sub_4591c0 ]
00464934    mov eax, dword ptr ss:[esp+0x08]
00464938    pop ecx
00464939    ret 0x04
