// ============================================================
// 函数名称: sub_485410
// 起始地址: 0x485410
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00485410    push 0x00
00485412    push dword ptr ss:[esp+0x14]
00485416    add ecx, 0x04
00485419    push dword ptr ss:[esp+0x14]
0048541D    push dword ptr ss:[esp+0x14]
00485421    call 0x00485840
00485426    ret 0x10                                        ; => [ Call: sub_485840 ]
