// ============================================================
// 函数名称: sub_63d790
// 起始地址: 0x63d790
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

0063D790    test ecx, ecx
0063D792    jz 0x0063D7A4
0063D794    cmp dword ptr ds:[ecx], 0x00
0063D797    jz 0x0063D7A4
0063D799    push 0x01
0063D79B    call 0x0063D660
0063D7A0    add esp, 0x04
0063D7A3    ret                                             ; => [ Call: sub_63d660 ]
0063D7A4    xor eax, eax
0063D7A6    ret
