// ============================================================
// 函数名称: sub_64c445
// 起始地址: 0x64c445
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

0064C445    push dword ptr ss:[ebp-0x14]
0064C448    call 0x0069AD76                                 ; => [ Call: j__free ]
0064C44D    add esp, 0x04
0064C450    push 0x00
0064C452    push 0x00
0064C454    call 0x0069DF2B                                 ; => [ Call: sub_69df2b | Call: nullptr ]
