// ============================================================
// 函数名称: sub_504860
// 起始地址: 0x504860
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00504860    push ecx
00504861    push dword ptr ss:[esp+0x10]
00504865    add ecx, 0x28
00504868    push dword ptr ss:[esp+0x10]
0050486C    push dword ptr ss:[esp+0x10]
00504870    call 0x00506570
00504875    ret 0x0C                                        ; => [ Call: sub_506570 ]
