// ============================================================
// 函数名称: sub_421e00
// 起始地址: 0x421e00
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00421E00    mov eax, dword ptr ds:[ecx+0x04]
00421E03    cmp eax, 0x0B
00421E06    jz 0x00421E15
00421E08    cmp eax, 0x03
00421E0B    jz 0x00421E15
00421E0D    cmp eax, 0x13
00421E10    jz 0x00421E15
00421E12    xor al, al
00421E14    ret
00421E15    mov al, 0x01
00421E17    ret
