// ============================================================
// 函数名称: sub_430a79
// 起始地址: 0x430a79
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00430A79    push dword ptr ss:[ebp+0x14]
00430A7C    call 0x0069AD76                                 ; => [ Call: j__free ]
00430A81    add esp, 0x04
00430A84    push 0x00
00430A86    push 0x00
00430A88    call 0x0069DF2B                                 ; => [ Call: sub_69df2b | Call: nullptr ]
