// ============================================================
// 函数名称: sub_485460
// 起始地址: 0x485460
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00485460    push 0x00
00485462    push dword ptr ss:[esp+0x18]
00485466    add ecx, 0x04
00485469    push dword ptr ss:[esp+0x18]
0048546D    push dword ptr ss:[esp+0x18]
00485471    push dword ptr ss:[esp+0x18]
00485475    call 0x00485930
0048547A    ret 0x14                                        ; => [ Call: sub_485930 ]
