// ============================================================
// 函数名称: sub_4591c0
// 起始地址: 0x4591c0
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

004591C0    push ecx
004591C1    push esi
004591C2    mov esi, ecx
004591C4    mov dword ptr ss:[esp+0x04], 0x00
004591CC    call 0x00459160                                 ; => [ Call: sub_459160 ]
004591D1    mov eax, esi
004591D3    pop esi
004591D4    pop ecx
004591D5    ret
