// ============================================================
// 函数名称: sub_4016f0
// 起始地址: 0x4016f0
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

004016F0    push 0x00
004016F2    push 0x6DA5BA
004016F7    mov ecx, 0x74F83C
004016FC    call 0x00402110                                 ; => [ Data: data_74f83c | Call: sub_402110 | Call: nullptr ]
00401701    push 0x6D2860
00401706    call 0x0069AD3F
0040170B    pop ecx
0040170C    ret                                             ; => [ Call: _atexit | Call: sub_6d2860 ]
