// ============================================================
// 函数名称: sub_46610b
// 起始地址: 0x46610b
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

0046610B    push dword ptr ss:[ebp-0x18]
0046610E    call 0x0069AD76                                 ; => [ Call: j__free ]
00466113    add esp, 0x04
00466116    push 0x00
00466118    push 0x00
0046611A    call 0x0069DF2B                                 ; => [ Call: sub_69df2b | Call: nullptr ]
