// ============================================================
// 函数名称: sub_578d5f
// 起始地址: 0x578d5f
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00578D5F    mov ecx, dword ptr ss:[ebp-0x14]
00578D62    call 0x00403510                                 ; => [ Call: sub_403510 ]
00578D67    push 0x00
00578D69    push 0x00
00578D6B    call 0x0069DF2B                                 ; => [ Call: sub_69df2b | Call: nullptr ]
