// ============================================================
// 函数名称: sub_422810
// 起始地址: 0x422810
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00422810    push esi
00422811    mov esi, ecx
00422813    call 0x00422830                                 ; => [ Call: sub_422830 ]
00422818    test byte ptr ss:[esp+0x08], 0x01
0042281D    jz 0x00422828
0042281F    push esi
00422820    call 0x0069AD76                                 ; => [ Call: j__free ]
00422825    add esp, 0x04
00422828    mov eax, esi
0042282A    pop esi
0042282B    ret 0x04
