// ============================================================
// 函数名称: sub_6c4221
// 起始地址: 0x6c4221
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

006C4221    mov eax, dword ptr ss:[ebp-0x70]
006C4224    and eax, 0x02
006C4227    jz 0x006C4239
006C422D    and dword ptr ss:[ebp-0x70], 0xFFFFFFFD
006C4231    lea ecx, ss:[ebp-0x58]
006C4234    jmp 0x00401FB0                                  ; => [ Call: sub_401fb0 ]
006C4239    ret
