// ============================================================
// 函数名称: sub_475800
// 起始地址: 0x475800
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00475800    push esi
00475801    mov esi, ecx
00475803    call 0x00475820                                 ; => [ Call: sub_475820 ]
00475808    test byte ptr ss:[esp+0x08], 0x01
0047580D    jz 0x00475818
0047580F    push esi
00475810    call 0x0069AD76                                 ; => [ Call: j__free ]
00475815    add esp, 0x04
00475818    mov eax, esi
0047581A    pop esi
0047581B    ret 0x04
