// ============================================================
// 函数名称: sub_452280
// 起始地址: 0x452280
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00452280    push esi
00452281    mov esi, ecx
00452283    call 0x004522A0                                 ; => [ Call: sub_4522a0 ]
00452288    test byte ptr ss:[esp+0x08], 0x01
0045228D    jz 0x00452298
0045228F    push esi
00452290    call 0x0069AD76                                 ; => [ Call: j__free ]
00452295    add esp, 0x04
00452298    mov eax, esi
0045229A    pop esi
0045229B    ret 0x04
