// ============================================================
// 函数名称: sub_401350
// 起始地址: 0x401350
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00401350    push 0x00
00401352    push 0x6DA0D1
00401357    mov ecx, 0x74F56C
0040135C    call 0x00402110                                 ; => [ Data: data_74f56c | Call: nullptr | Call: sub_402110 ]
00401361    push 0x6D1D30
00401366    call 0x0069AD3F
0040136B    pop ecx
0040136C    ret                                             ; => [ Call: sub_6d1d30 | Call: _atexit ]
