// ============================================================
// 函数名称: sub_5690fe
// 起始地址: 0x5690fe
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

005690FE    mov ecx, dword ptr ss:[ebp-0x18]
00569101    call 0x00410440                                 ; => [ Call: sub_410440 ]
00569106    push 0x00
00569108    push 0x00
0056910A    call 0x0069DF2B                                 ; => [ Call: sub_69df2b | Call: nullptr ]
