// ============================================================
// 函数名称: sub_44138e
// 起始地址: 0x44138e
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

0044138E    mov ecx, dword ptr ss:[ebp-0x14]
00441391    call 0x004414B0                                 ; => [ Call: sub_4414b0 ]
00441396    push 0x00
00441398    push 0x00
0044139A    call 0x0069DF2B                                 ; => [ Call: sub_69df2b | Call: nullptr ]
