// ============================================================
// 函数名称: sub_450f70
// 起始地址: 0x450f70
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00450F70    push dword ptr ss:[ebp-0x14]
00450F73    call 0x0069AD76                                 ; => [ Call: j__free ]
00450F78    add esp, 0x04
00450F7B    push 0x00
00450F7D    push 0x00
00450F7F    call 0x0069DF2B                                 ; => [ Call: sub_69df2b | Call: nullptr ]
