// ============================================================
// 函数名称: sub_608020
// 起始地址: 0x608020
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00608020    push esi
00608021    mov esi, ecx
00608023    call 0x00608040                                 ; => [ Call: sub_608040 ]
00608028    test byte ptr ss:[esp+0x08], 0x01
0060802D    jz 0x00608038
0060802F    push esi
00608030    call 0x0069AD76                                 ; => [ Call: j__free ]
00608035    add esp, 0x04
00608038    mov eax, esi
0060803A    pop esi
0060803B    ret 0x04
