// ============================================================
// 函数名称: sub_405760
// 起始地址: 0x405760
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00405760    mov eax, dword ptr ss:[esp+0x04]
00405764    push esi
00405765    mov esi, ecx
00405767    cmp esi, eax
00405769    jz 0x00405775
0040576B    push 0xFFFFFFFF
0040576D    push 0x00
0040576F    push eax
00405770    call 0x00401FF0                                 ; => [ Call: sub_401ff0 ]
00405775    mov eax, esi
00405777    pop esi
00405778    ret 0x04
