// ============================================================
// 函数名称: sub_466500
// 起始地址: 0x466500
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00466500    push esi
00466501    mov esi, ecx
00466503    call 0x00466520                                 ; => [ Call: sub_466520 ]
00466508    test byte ptr ss:[esp+0x08], 0x01
0046650D    jz 0x00466518
0046650F    push esi
00466510    call 0x0069AD76                                 ; => [ Call: j__free ]
00466515    add esp, 0x04
00466518    mov eax, esi
0046651A    pop esi
0046651B    ret 0x04
