// ============================================================
// 函数名称: sub_609680
// 起始地址: 0x609680
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00609680    push esi
00609681    mov esi, ecx
00609683    call 0x006096A0                                 ; => [ Call: sub_6096a0 ]
00609688    test byte ptr ss:[esp+0x08], 0x01
0060968D    jz 0x00609698
0060968F    push esi
00609690    call 0x0069AD76                                 ; => [ Call: j__free ]
00609695    add esp, 0x04
00609698    mov eax, esi
0060969A    pop esi
0060969B    ret 0x04
