// ============================================================
// 函数名称: sub_455010
// 起始地址: 0x455010
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00455010    push esi
00455011    mov esi, ecx
00455013    call 0x00455030                                 ; => [ Call: sub_455030 ]
00455018    test byte ptr ss:[esp+0x08], 0x01
0045501D    jz 0x00455028
0045501F    push esi
00455020    call 0x0069AD76                                 ; => [ Call: j__free ]
00455025    add esp, 0x04
00455028    mov eax, esi
0045502A    pop esi
0045502B    ret 0x04
