// ============================================================
// 函数名称: sub_413410
// 起始地址: 0x413410
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00413410    push 0x01
00413412    push 0x03
00413414    push dword ptr ss:[esp+0x0C]
00413418    call dword ptr ds:[0x006D4408]
0041341E    push 0x00
00413420    push 0x03
00413422    push dword ptr ss:[esp+0x0C]
00413426    call dword ptr ds:[0x006D4404]
0041342C    xor eax, eax
0041342E    ret 0x0C
