// ============================================================
// 函数名称: sub_401790
// 起始地址: 0x401790
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00401790    push 0x00
00401792    push 0x6DA5FA
00401797    mov ecx, 0x74F8B4
0040179C    call 0x00402110                                 ; => [ Data: data_74f8b4 | Call: nullptr | Call: sub_402110 ]
004017A1    push 0x6D2A40
004017A6    call 0x0069AD3F
004017AB    pop ecx
004017AC    ret                                             ; => [ Call: sub_6d2a40 | Call: _atexit ]
