// ============================================================
// 函数名称: sub_672200
// 起始地址: 0x672200
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00672200    push esi
00672201    mov esi, ecx
00672203    call 0x00672220                                 ; => [ Call: sub_672220 ]
00672208    test byte ptr ss:[esp+0x08], 0x01
0067220D    jz 0x00672218
0067220F    push esi
00672210    call 0x0069AD76                                 ; => [ Call: j__free ]
00672215    add esp, 0x04
00672218    mov eax, esi
0067221A    pop esi
0067221B    ret 0x04
