// ============================================================
// 函数名称: sub_547010
// 起始地址: 0x547010
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00547010    push esi
00547011    mov esi, ecx
00547013    call 0x00547030                                 ; => [ Call: sub_547030 ]
00547018    test byte ptr ss:[esp+0x08], 0x01
0054701D    jz 0x00547028
0054701F    push esi
00547020    call 0x0069AD76                                 ; => [ Call: j__free ]
00547025    add esp, 0x04
00547028    mov eax, esi
0054702A    pop esi
0054702B    ret 0x04
