// ============================================================
// 函数名称: sub_429700
// 起始地址: 0x429700
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00429700    push esi
00429701    mov esi, ecx
00429703    cmp byte ptr ds:[esi+0x88], 0x00
0042970A    jz 0x00429719
0042970C    call dword ptr ds:[0x006D43F0]
00429712    mov byte ptr ds:[esi+0x88], 0x00
00429719    xor eax, eax
0042971B    pop esi
0042971C    ret 0x0C
