// ============================================================
// 函数名称: sub_484cfa
// 起始地址: 0x484cfa
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00484CFA    mov ecx, dword ptr ss:[ebp-0x14]
00484CFD    call 0x004813F0                                 ; => [ Call: sub_4813f0 ]
00484D02    push 0x00
00484D04    push 0x00
00484D06    call 0x0069DF2B                                 ; => [ Call: sub_69df2b | Call: nullptr ]
