// ============================================================
// 函数名称: sub_57939b
// 起始地址: 0x57939b
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

0057939B    push dword ptr ss:[ebp-0x14]
0057939E    call 0x0069AD76                                 ; => [ Call: j__free ]
005793A3    add esp, 0x04
005793A6    push 0x00
005793A8    push 0x00
005793AA    call 0x0069DF2B                                 ; => [ Call: sub_69df2b | Call: nullptr ]
