// ============================================================
// 函数名称: sub_471c78
// 起始地址: 0x471c78
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00471C78    push dword ptr ss:[ebp-0x14]
00471C7B    call 0x0069AD76                                 ; => [ Call: j__free ]
00471C80    add esp, 0x04
00471C83    push 0x00
00471C85    push 0x00
00471C87    call 0x0069DF2B                                 ; => [ Call: sub_69df2b | Call: nullptr ]
