// ============================================================
// 函数名称: sub_510030
// 起始地址: 0x510030
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00510030    push esi
00510031    mov esi, ecx
00510033    call 0x00510050                                 ; => [ Call: sub_510050 ]
00510038    test byte ptr ss:[esp+0x08], 0x01
0051003D    jz 0x00510048
0051003F    push esi
00510040    call 0x0069AD76                                 ; => [ Call: j__free ]
00510045    add esp, 0x04
00510048    mov eax, esi
0051004A    pop esi
0051004B    ret 0x04
