// ============================================================
// 函数名称: sub_478730
// 起始地址: 0x478730
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00478730    mov eax, dword ptr ds:[0x0075D4E4]
00478735    mov ecx, dword ptr ds:[eax+0x93C]               ; => [ Data: data_75d4e4 ]
0047873B    test ecx, ecx
0047873D    jnz 0x00478742
0047873F    xor al, al
00478741    ret
00478742    push ecx
00478743    add ecx, 0x94
00478749    call 0x0046EBD0
0047874E    ret                                             ; => [ Call: sub_46ebd0 ]
