// ============================================================
// 函数名称: sub_401510
// 起始地址: 0x401510
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00401510    push 0x00
00401512    push 0x6DA253
00401517    mov ecx, 0x74F6A4
0040151C    call 0x00402110                                 ; => [ Data: data_74f6a4 | Call: nullptr | Call: sub_402110 ]
00401521    push 0x6D22C0
00401526    call 0x0069AD3F
0040152B    pop ecx
0040152C    ret                                             ; => [ Call: sub_6d22c0 | Call: _atexit ]
