// ============================================================
// 函数名称: sub_467310
// 起始地址: 0x467310
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00467310    push esi
00467311    mov esi, ecx
00467313    call 0x0043F340                                 ; => [ Call: sub_43f340 ]
00467318    push dword ptr ds:[esi]
0046731A    call 0x0069AD76
0046731F    add esp, 0x04
00467322    pop esi
00467323    ret                                             ; => [ Call: j__free ]
