// ============================================================
// 函数名称: sub_5b6864
// 起始地址: 0x5b6864
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

005B6864    mov ecx, dword ptr ss:[ebp-0x14]
005B6867    call 0x005B68F0                                 ; => [ Call: sub_5b68f0 ]
005B686C    push 0x00
005B686E    push 0x00
005B6870    call 0x0069DF2B                                 ; => [ Call: sub_69df2b | Call: nullptr ]
