// ============================================================
// 函数名称: sub_550100
// 起始地址: 0x550100
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00550100    push esi
00550101    mov esi, dword ptr ss:[esp+0x08]
00550105    lea ecx, ds:[esi+0x10]
00550108    call 0x00551470                                 ; => [ Call: sub_551470 ]
0055010D    push esi
0055010E    call 0x0069AD76
00550113    add esp, 0x04
00550116    pop esi
00550117    ret 0x04                                        ; => [ Call: j__free ]
