// ============================================================
// 函数名称: sub_509620
// 起始地址: 0x509620
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00509620    push esi
00509621    mov esi, ecx
00509623    call 0x00509640                                 ; => [ Call: sub_509640 ]
00509628    test byte ptr ss:[esp+0x08], 0x01
0050962D    jz 0x00509638
0050962F    push esi
00509630    call 0x0069AD76                                 ; => [ Call: j__free ]
00509635    add esp, 0x04
00509638    mov eax, esi
0050963A    pop esi
0050963B    ret 0x04
