// ============================================================
// 函数名称: sub_4034c0
// 起始地址: 0x4034c0
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

004034C0    mov eax, dword ptr ss:[esp+0x04]
004034C4    test eax, eax
004034C6    jns 0x004034CD
004034C8    xor al, al
004034CA    ret 0x04
004034CD    push eax
004034CE    add ecx, 0x14
004034D1    call 0x00403540                                 ; => [ Call: sub_403540 ]
004034D6    mov al, 0x01
004034D8    ret 0x04
