// ============================================================
// 函数名称: sub_435b8a
// 起始地址: 0x435b8a
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00435B8A    mov ecx, dword ptr ss:[ebp-0x14]
00435B8D    call 0x00435C20                                 ; => [ Call: sub_435c20 ]
00435B92    push 0x00
00435B94    push 0x00
00435B96    call 0x0069DF2B                                 ; => [ Call: sub_69df2b | Call: nullptr ]
