// ============================================================
// 函数名称: sub_5284f0
// 起始地址: 0x5284f0
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

005284F0    push esi
005284F1    mov esi, ecx
005284F3    call 0x00528510                                 ; => [ Call: sub_528510 ]
005284F8    test byte ptr ss:[esp+0x08], 0x01
005284FD    jz 0x00528508
005284FF    push esi
00528500    call 0x0069AD76                                 ; => [ Call: j__free ]
00528505    add esp, 0x04
00528508    mov eax, esi
0052850A    pop esi
0052850B    ret 0x04
