// ============================================================
// 函数名称: sub_413d67
// 起始地址: 0x413d67
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00413D67    push dword ptr ss:[ebp-0x14]
00413D6A    call 0x0069AD76                                 ; => [ Call: j__free ]
00413D6F    add esp, 0x04
00413D72    push 0x00
00413D74    push 0x00
00413D76    call 0x0069DF2B                                 ; => [ Call: sub_69df2b | Call: nullptr ]
