// ============================================================
// 函数名称: sub_401330
// 起始地址: 0x401330
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00401330    push 0x00
00401332    push 0x6DA09E
00401337    mov ecx, 0x74F554
0040133C    call 0x00402110                                 ; => [ Data: data_74f554 | Call: nullptr | Call: sub_402110 ]
00401341    push 0x6D1CD0
00401346    call 0x0069AD3F
0040134B    pop ecx
0040134C    ret                                             ; => [ Call: sub_6d1cd0 | Call: _atexit ]
