// ============================================================
// 函数名称: sub_566f43
// 起始地址: 0x566f43
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00566F43    push dword ptr ss:[ebp-0x14]
00566F46    call 0x0069AD76                                 ; => [ Call: j__free ]
00566F4B    add esp, 0x04
00566F4E    push 0x00
00566F50    push 0x00
00566F52    call 0x0069DF2B                                 ; => [ Call: sub_69df2b | Call: nullptr ]
