// ============================================================
// 函数名称: sub_401920
// 起始地址: 0x401920
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00401920    push 0x00
00401922    push 0x6DA78F
00401927    mov ecx, 0x74F994
0040192C    call 0x00402110                                 ; => [ Call: nullptr | Call: sub_402110 | Data: data_74f994 ]
00401931    push 0x6D2E90
00401936    call 0x0069AD3F
0040193B    pop ecx
0040193C    ret                                             ; => [ Call: sub_6d2e90 | Call: _atexit ]
