// ============================================================
// 函数名称: sub_421e20
// 起始地址: 0x421e20
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00421E20    mov eax, dword ptr ds:[ecx+0x04]
00421E23    cmp eax, 0x0C
00421E26    jz 0x00421E35
00421E28    cmp eax, 0x04
00421E2B    jz 0x00421E35
00421E2D    cmp eax, 0x14
00421E30    jz 0x00421E35
00421E32    xor al, al
00421E34    ret
00421E35    mov al, 0x01
00421E37    ret
