// ============================================================
// 函数名称: sub_4587b0
// 起始地址: 0x4587b0
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

004587B0    push dword ptr ss:[ebp-0x14]
004587B3    call 0x0069AD76                                 ; => [ Call: j__free ]
004587B8    add esp, 0x04
004587BB    push 0x00
004587BD    push 0x00
004587BF    call 0x0069DF2B                                 ; => [ Call: sub_69df2b | Call: nullptr ]
