// ============================================================
// 函数名称: sub_4781f9
// 起始地址: 0x4781f9
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

004781F9    push dword ptr ss:[ebp+0x14]
004781FC    call 0x0069AD76                                 ; => [ Call: j__free ]
00478201    add esp, 0x04
00478204    push 0x00
00478206    push 0x00
00478208    call 0x0069DF2B                                 ; => [ Call: sub_69df2b | Call: nullptr ]
