// ============================================================
// 函数名称: sub_4d9374
// 起始地址: 0x4d9374
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

004D9374    mov ecx, dword ptr ss:[ebp-0x14]
004D9377    call 0x004D87C0                                 ; => [ Call: sub_4d87c0 ]
004D937C    push 0x00
004D937E    push 0x00
004D9380    call 0x0069DF2B                                 ; => [ Call: sub_69df2b | Call: nullptr ]
