// ============================================================
// 函数名称: sub_468250
// 起始地址: 0x468250
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00468250    push ecx
00468251    lea edx, ds:[ecx+0x04]
00468254    mov dword ptr ss:[esp], 0x00
0046825B    mov ecx, dword ptr ss:[esp+0x08]
0046825F    call 0x004591C0                                 ; => [ Call: sub_4591c0 ]
00468264    mov eax, dword ptr ss:[esp+0x08]
00468268    pop ecx
00468269    ret 0x04
