// ============================================================
// 函数名称: sub_401870
// 起始地址: 0x401870
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00401870    push 0x00
00401872    push 0x6DA65E
00401877    mov ecx, 0x74F92C
0040187C    call 0x00402110                                 ; => [ Data: data_74f92c | Call: sub_402110 | Call: nullptr ]
00401881    push 0x6D2CE0
00401886    call 0x0069AD3F
0040188B    pop ecx
0040188C    ret                                             ; => [ Call: sub_6d2ce0 | Call: _atexit ]
