// ============================================================
// 函数名称: sub_418780
// 起始地址: 0x418780
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00418780    push esi
00418781    call 0x004187B0                                 ; => [ Call: sub_4187b0 ]
00418786    mov esi, eax
00418788    lea ecx, ds:[esi+0x10]
0041878B    mov word ptr ds:[esi+0x0C], 0x00
00418791    test ecx, ecx
00418793    jz 0x004187A0
00418795    push dword ptr ss:[esp+0x08]
00418799    call 0x00403000                                 ; => [ Call: sub_403000 ]
0041879E    mov eax, esi
004187A0    pop esi
004187A1    ret 0x04
