// ============================================================
// 函数名称: sub_4058f0
// 起始地址: 0x4058f0
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

004058F0    sub esp, 0x08
004058F3    push dword ptr ss:[esp+0x0C]
004058F7    mov dword ptr ss:[esp+0x08], 0x00
004058FF    call 0x004220A0                                 ; => [ Call: sub_4220a0 ]
00405904    mov eax, dword ptr ss:[esp+0x0C]
00405908    add esp, 0x08
0040590B    ret 0x04
