// ============================================================
// 函数名称: sub_401370
// 起始地址: 0x401370
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00401370    push 0x00
00401372    push 0x6DA0FB
00401377    mov ecx, 0x74F584
0040137C    call 0x00402110                                 ; => [ Data: data_74f584 | Call: nullptr | Call: sub_402110 ]
00401381    push 0x6D1D90
00401386    call 0x0069AD3F
0040138B    pop ecx
0040138C    ret                                             ; => [ Call: sub_6d1d90 | Call: _atexit ]
