// ============================================================
// 函数名称: sub_686870
// 起始地址: 0x686870
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00686870    push esi
00686871    mov esi, ecx
00686873    call 0x00686890                                 ; => [ Call: sub_686890 ]
00686878    test byte ptr ss:[esp+0x08], 0x01
0068687D    jz 0x00686888
0068687F    push esi
00686880    call 0x0069AD76                                 ; => [ Call: j__free ]
00686885    add esp, 0x04
00686888    mov eax, esi
0068688A    pop esi
0068688B    ret 0x04
