// ============================================================
// 函数名称: sub_4015f0
// 起始地址: 0x4015f0
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

004015F0    push 0x00
004015F2    push 0x6DA2A7
004015F7    mov ecx, 0x74F77C
004015FC    call 0x00402110                                 ; => [ Data: data_74f77c | Call: nullptr | Call: sub_402110 ]
00401601    push 0x6D2560
00401606    call 0x0069AD3F
0040160B    pop ecx
0040160C    ret                                             ; => [ Call: sub_6d2560 | Call: _atexit ]
