// ============================================================
// 函数名称: sub_591890
// 起始地址: 0x591890
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00591890    push esi
00591891    mov esi, ecx
00591893    call 0x005918B0                                 ; => [ Call: sub_5918b0 ]
00591898    test byte ptr ss:[esp+0x08], 0x01
0059189D    jz 0x005918A8
0059189F    push esi
005918A0    call 0x0069AD76                                 ; => [ Call: j__free ]
005918A5    add esp, 0x04
005918A8    mov eax, esi
005918AA    pop esi
005918AB    ret 0x04
