// ============================================================
// 函数名称: sub_401430
// 起始地址: 0x401430
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00401430    push 0x00
00401432    push 0x6DA21B
00401437    mov ecx, 0x74F62C
0040143C    call 0x00402110                                 ; => [ Data: data_74f62c | Call: nullptr | Call: sub_402110 ]
00401441    push 0x6D2020
00401446    call 0x0069AD3F
0040144B    pop ecx
0040144C    ret                                             ; => [ Call: sub_6d2020 | Call: _atexit ]
