// ============================================================
// 函数名称: sub_637370
// 起始地址: 0x637370
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00637370    push esi
00637371    mov esi, ecx
00637373    call 0x00637390                                 ; => [ Call: sub_637390 ]
00637378    test byte ptr ss:[esp+0x08], 0x01
0063737D    jz 0x00637388
0063737F    push esi
00637380    call 0x0069AD76                                 ; => [ Call: j__free ]
00637385    add esp, 0x04
00637388    mov eax, esi
0063738A    pop esi
0063738B    ret 0x04
