// ============================================================
// 函数名称: sub_401570
// 起始地址: 0x401570
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00401570    push 0x00
00401572    push 0x6DA25F
00401577    mov ecx, 0x74F71C
0040157C    call 0x00402110                                 ; => [ Data: data_74f71c | String: ,\n\n} | Call: nullptr | Call: sub_402110 ]
00401581    push 0x6D23E0
00401586    call 0x0069AD3F
0040158B    pop ecx
0040158C    ret                                             ; => [ Call: sub_6d23e0 | Call: _atexit ]
