// ============================================================
// 函数名称: sub_5500e0
// 起始地址: 0x5500e0
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

005500E0    push esi
005500E1    mov esi, dword ptr ss:[esp+0x08]
005500E5    lea ecx, ds:[esi+0x10]
005500E8    call 0x00551400                                 ; => [ Call: sub_551400 ]
005500ED    push esi
005500EE    call 0x0069AD76
005500F3    add esp, 0x04
005500F6    pop esi
005500F7    ret 0x04                                        ; => [ Call: j__free ]
