// ============================================================
// 函数名称: sub_4d3150
// 起始地址: 0x4d3150
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

004D3150    dword 102474FF
004D3154    push dword ptr ss:[esp+0x10]
004D3158    push dword ptr ss:[esp+0x10]
004D315C    sub esp, 0x08
004D315F    push dword ptr ss:[esp+0x18]
004D3163    call 0x004D3340
004D3168    ret 0x10                                        ; => [ Call: sub_4d3340 ]
