// ============================================================
// 函数名称: sub_6b3502
// 起始地址: 0x6b3502
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

006B3502    mov eax, dword ptr ss:[ebp-0x100]
006B3508    and eax, 0x01
006B350B    jz 0x006B3523
006B3511    and dword ptr ss:[ebp-0x100], 0xFFFFFFFE
006B3518    lea ecx, ss:[ebp-0x84]
006B351E    jmp 0x00405BD0                                  ; => [ Call: j_sub_405be0 ]
006B3523    ret
