// ============================================================
// 函数名称: sub_648230
// 起始地址: 0x648230
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00648230    push esi
00648231    mov esi, ecx
00648233    lea ecx, ds:[esi+0x1E0]
00648239    call 0x00638740                                 ; => [ Call: sub_638740 ]
0064823E    lea ecx, ds:[esi+0x250]
00648244    call 0x00638370                                 ; => [ Call: sub_638370 ]
00648249    mov dword ptr ds:[esi+0x58], 0x02
00648250    pop esi
00648251    ret
