// ============================================================
// 函数名称: sub_461970
// 起始地址: 0x461970
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00461970    push esi
00461971    push edi
00461972    mov edi, ecx
00461974    lea esi, ds:[edi+0x08]
00461977    mov ecx, esi
00461979    call 0x00460B40                                 ; => [ Call: sub_460b40 ]
0046197E    push esi
0046197F    lea ecx, ds:[edi+0x2C]
00461982    call 0x00459CD0
00461987    pop edi
00461988    pop esi
00461989    ret                                             ; => [ Call: sub_459cd0 ]
