// ============================================================
// 函数名称: sub_442090
// 起始地址: 0x442090
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00442090    push esi
00442091    mov esi, ecx
00442093    call 0x004420B0                                 ; => [ Call: sub_4420b0 ]
00442098    test byte ptr ss:[esp+0x08], 0x01
0044209D    jz 0x004420A8
0044209F    push esi
004420A0    call 0x0069AD76                                 ; => [ Call: j__free ]
004420A5    add esp, 0x04
004420A8    mov eax, esi
004420AA    pop esi
004420AB    ret 0x04
