// ============================================================
// 函数名称: sub_536710
// 起始地址: 0x536710
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00536710    push esi
00536711    mov esi, ecx
00536713    call 0x005368B0                                 ; => [ Call: sub_5368b0 ]
00536718    test byte ptr ss:[esp+0x08], 0x01
0053671D    jz 0x00536728
0053671F    push esi
00536720    call 0x0069AD76                                 ; => [ Call: j__free ]
00536725    add esp, 0x04
00536728    mov eax, esi
0053672A    pop esi
0053672B    ret 0x04
