// ============================================================
// 函数名称: sub_5b972a
// 起始地址: 0x5b972a
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

005B972A    mov ecx, dword ptr ss:[ebp-0x14]
005B972D    call 0x005B8B80                                 ; => [ Call: sub_5b8b80 ]
005B9732    push 0x00
005B9734    push 0x00
005B9736    call 0x0069DF2B                                 ; => [ Call: sub_69df2b | Call: nullptr ]
