// ============================================================
// 函数名称: sub_45545e
// 起始地址: 0x45545e
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

0045545E    mov ecx, dword ptr ss:[ebp-0x14]
00455461    call 0x004414B0                                 ; => [ Call: sub_4414b0 ]
00455466    push 0x00
00455468    push 0x00
0045546A    call 0x0069DF2B                                 ; => [ Call: sub_69df2b | Call: nullptr ]
