// ============================================================
// 函数名称: sub_579594
// 起始地址: 0x579594
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00579594    push dword ptr ss:[ebp-0x18]
00579597    call 0x0069AD76                                 ; => [ Call: j__free ]
0057959C    add esp, 0x04
0057959F    push 0x00
005795A1    push 0x00
005795A3    call 0x0069DF2B                                 ; => [ Call: sub_69df2b | Call: nullptr ]
