// ============================================================
// 函数名称: sub_5098f0
// 起始地址: 0x5098f0
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

005098F0    push esi
005098F1    mov esi, ecx
005098F3    call 0x00509910                                 ; => [ Call: sub_509910 ]
005098F8    test byte ptr ss:[esp+0x08], 0x01
005098FD    jz 0x00509908
005098FF    push esi
00509900    call 0x0069AD76                                 ; => [ Call: j__free ]
00509905    add esp, 0x04
00509908    mov eax, esi
0050990A    pop esi
0050990B    ret 0x04
