// ============================================================
// 函数名称: sub_579677
// 起始地址: 0x579677
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00579677    push dword ptr ss:[ebp-0x18]
0057967A    call 0x0069AD76                                 ; => [ Call: j__free ]
0057967F    add esp, 0x04
00579682    push 0x00
00579684    push 0x00
00579686    call 0x0069DF2B                                 ; => [ Call: sub_69df2b | Call: nullptr ]
