// ============================================================
// 函数名称: sub_4890f0
// 起始地址: 0x4890f0
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

004890F0    push esi
004890F1    mov esi, ecx
004890F3    call 0x00489110                                 ; => [ Call: sub_489110 ]
004890F8    test byte ptr ss:[esp+0x08], 0x01
004890FD    jz 0x00489108
004890FF    push esi
00489100    call 0x0069AD76                                 ; => [ Call: j__free ]
00489105    add esp, 0x04
00489108    mov eax, esi
0048910A    pop esi
0048910B    ret 0x04
