// ============================================================
// 函数名称: sub_401450
// 起始地址: 0x401450
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00401450    push 0x00
00401452    push 0x6DA222
00401457    mov ecx, 0x74F614
0040145C    call 0x00402110                                 ; => [ Call: nullptr | Call: sub_402110 | Data: data_74f614 ]
00401461    push 0x6D2080
00401466    call 0x0069AD3F
0040146B    pop ecx
0040146C    ret                                             ; => [ Call: sub_6d2080 | Call: _atexit ]
