// ============================================================
// 函数名称: sub_440960
// 起始地址: 0x440960
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00440960    push esi
00440961    mov esi, ecx
00440963    call 0x00440980                                 ; => [ Call: sub_440980 ]
00440968    test byte ptr ss:[esp+0x08], 0x01
0044096D    jz 0x00440978
0044096F    push esi
00440970    call 0x0069AD76                                 ; => [ Call: j__free ]
00440975    add esp, 0x04
00440978    mov eax, esi
0044097A    pop esi
0044097B    ret 0x04
