// ============================================================
// 函数名称: sub_401810
// 起始地址: 0x401810
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00401810    push 0x00
00401812    push 0x6DA61A
00401817    mov ecx, 0x74F914
0040181C    call 0x00402110                                 ; => [ Data: data_74f914 | Call: nullptr | Call: sub_402110 ]
00401821    push 0x6D2BC0
00401826    call 0x0069AD3F
0040182B    pop ecx
0040182C    ret                                             ; => [ Call: sub_6d2bc0 | Call: _atexit ]
