// ============================================================
// 函数名称: sub_618580
// 起始地址: 0x618580
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00618580    push esi
00618581    mov esi, ecx
00618583    call 0x006185A0                                 ; => [ Call: sub_6185a0 ]
00618588    test byte ptr ss:[esp+0x08], 0x01
0061858D    jz 0x00618598
0061858F    push esi
00618590    call 0x0069AD76                                 ; => [ Call: j__free ]
00618595    add esp, 0x04
00618598    mov eax, esi
0061859A    pop esi
0061859B    ret 0x04
