// ============================================================
// 函数名称: sub_401890
// 起始地址: 0x401890
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00401890    push 0x00
00401892    push 0x6DA6FA
00401897    mov ecx, 0x74F974
0040189C    call 0x00402110                                 ; => [ Call: nullptr | Call: sub_402110 | Data: data_74f974 ]
004018A1    push 0x6D2D40
004018A6    call 0x0069AD3F
004018AB    pop ecx
004018AC    ret                                             ; => [ Call: sub_6d2d40 | Call: _atexit ]
