// ============================================================
// 函数名称: sub_401530
// 起始地址: 0x401530
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00401530    push 0x00
00401532    push 0x6DA25E
00401537    mov ecx, 0x74F6EC
0040153C    call 0x00402110                                 ; => [ Data: data_74f6ec | String: ,\n\n} | Call: nullptr | Call: sub_402110 ]
00401541    push 0x6D2320
00401546    call 0x0069AD3F
0040154B    pop ecx
0040154C    ret                                             ; => [ Call: sub_6d2320 | Call: _atexit ]
