// ============================================================
// 函数名称: sub_689280
// 起始地址: 0x689280
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00689280    push esi
00689281    mov esi, ecx
00689283    call 0x006892A0                                 ; => [ Call: sub_6892a0 ]
00689288    test byte ptr ss:[esp+0x08], 0x01
0068928D    jz 0x00689298
0068928F    push esi
00689290    call 0x0069AD76                                 ; => [ Call: j__free ]
00689295    add esp, 0x04
00689298    mov eax, esi
0068929A    pop esi
0068929B    ret 0x04
