// ============================================================
// 函数名称: sub_537040
// 起始地址: 0x537040
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00537040    mov eax, dword ptr ss:[esp+0x04]
00537044    add ecx, 0xB8
0053704A    cmp ecx, eax
0053704C    jz 0x00537058
0053704E    push 0xFFFFFFFF
00537050    push 0x00
00537052    push eax
00537053    call 0x00401FF0                                 ; => [ Call: sub_401ff0 ]
00537058    ret 0x04
