// ============================================================
// 函数名称: sub_481594
// 起始地址: 0x481594
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00481594    push dword ptr ss:[ebp-0x18]
00481597    call 0x0069AD76                                 ; => [ Call: j__free ]
0048159C    add esp, 0x04
0048159F    push 0x00
004815A1    push 0x00
004815A3    call 0x0069DF2B                                 ; => [ Call: sub_69df2b | Call: nullptr ]
