// ============================================================
// 函数名称: _exit
// 起始地址: 0x69d254
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

0069D254    push ebp
0069D255    mov ebp, esp
0069D257    push 0x00
0069D259    push 0x00
0069D25B    push dword ptr ss:[ebp+0x08]
0069D25E    call 0x0069D125                                 ; => [ Call: _doexit ]
0069D263    add esp, 0x0C
0069D266    pop ebp
0069D267    ret
