// ============================================================
// 函数名称: sub_464820
// 起始地址: 0x464820
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00464820    push esi
00464821    mov esi, ecx
00464823    call 0x00464840                                 ; => [ Call: sub_464840 ]
00464828    test byte ptr ss:[esp+0x08], 0x01
0046482D    jz 0x00464838
0046482F    push esi
00464830    call 0x0069AD76                                 ; => [ Call: j__free ]
00464835    add esp, 0x04
00464838    mov eax, esi
0046483A    pop esi
0046483B    ret 0x04
