// ============================================================
// 函数名称: sub_556810
// 起始地址: 0x556810
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00556810    push esi
00556811    mov esi, ecx
00556813    call 0x00556830                                 ; => [ Call: sub_556830 ]
00556818    test byte ptr ss:[esp+0x08], 0x01
0055681D    jz 0x00556828
0055681F    push esi
00556820    call 0x0069AD76                                 ; => [ Call: j__free ]
00556825    add esp, 0x04
00556828    mov eax, esi
0055682A    pop esi
0055682B    ret 0x04
