// ============================================================
// 函数名称: sub_410c40
// 起始地址: 0x410c40
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00410C40    test edx, edx
00410C42    jz 0x00410C53
00410C44    test ecx, ecx
00410C46    jz 0x00410C4D
00410C48    call 0x0040D770                                 ; => [ Call: sub_40d770 ]
00410C4D    add ecx, 0x74
00410C50    dec edx
00410C51    jnz 0x00410C44
00410C53    ret
