// ============================================================
// 函数名称: sub_47199a
// 起始地址: 0x47199a
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

0047199A    push dword ptr ss:[ebp-0x14]
0047199D    call 0x0069AD76                                 ; => [ Call: j__free ]
004719A2    add esp, 0x04
004719A5    push 0x00
004719A7    push 0x00
004719A9    call 0x0069DF2B                                 ; => [ Call: sub_69df2b | Call: nullptr ]
