// ============================================================
// 函数名称: sub_401610
// 起始地址: 0x401610
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00401610    push 0x00
00401612    push 0x6DA2C3
00401617    mov ecx, 0x74F764
0040161C    call 0x00402110                                 ; => [ Data: data_74f764 | Call: sub_402110 | Call: nullptr ]
00401621    push 0x6D25C0
00401626    call 0x0069AD3F
0040162B    pop ecx
0040162C    ret                                             ; => [ Call: sub_6d25c0 | Call: _atexit ]
