// ============================================================
// 函数名称: sub_401770
// 起始地址: 0x401770
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00401770    push 0x06
00401772    push 0x6E21C8
00401777    mov ecx, 0x74F884
0040177C    call 0x00402110                                 ; => [ Data: data_74f884 | String: <save> | Call: sub_402110 ]
00401781    push 0x6D29E0
00401786    call 0x0069AD3F
0040178B    pop ecx
0040178C    ret                                             ; => [ Call: sub_6d29e0 | Call: _atexit ]
