// ============================================================
// 函数名称: sub_460970
// 起始地址: 0x460970
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00460970    push ecx
00460971    lea edx, ds:[ecx+0x14]
00460974    mov dword ptr ss:[esp], 0x00
0046097B    mov ecx, dword ptr ss:[esp+0x08]
0046097F    call 0x004591C0                                 ; => [ Call: sub_4591c0 ]
00460984    mov eax, dword ptr ss:[esp+0x08]
00460988    pop ecx
00460989    ret 0x04
