// ============================================================
// 函数名称: sub_6b9466
// 起始地址: 0x6b9466
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

006B9466    mov eax, dword ptr ss:[ebp-0x1A4]
006B946C    and eax, 0x01
006B946F    jz 0x006B9487
006B9475    and dword ptr ss:[ebp-0x1A4], 0xFFFFFFFE
006B947C    lea ecx, ss:[ebp-0x1A0]
006B9482    jmp 0x00604940                                  ; => [ Call: sub_604940 ]
006B9487    ret
