// ============================================================
// 函数名称: sub_505770
// 起始地址: 0x505770
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00505770    push esi
00505771    mov esi, ecx
00505773    call 0x00505790                                 ; => [ Call: sub_505790 ]
00505778    test byte ptr ss:[esp+0x08], 0x01
0050577D    jz 0x00505788
0050577F    push esi
00505780    call 0x0069AD76                                 ; => [ Call: j__free ]
00505785    add esp, 0x04
00505788    mov eax, esi
0050578A    pop esi
0050578B    ret 0x04
