// ============================================================
// 函数名称: sub_401690
// 起始地址: 0x401690
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00401690    push 0x00
00401692    push 0x6DA53B
00401697    mov ecx, 0x74F7C4
0040169C    call 0x00402110                                 ; => [ Data: data_74f7c4 | Call: nullptr | Call: sub_402110 ]
004016A1    push 0x6D2740
004016A6    call 0x0069AD3F
004016AB    pop ecx
004016AC    ret                                             ; => [ Call: sub_6d2740 | Call: _atexit ]
