// ============================================================
// 函数名称: sub_5b437c
// 起始地址: 0x5b437c
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

005B437C    mov ecx, dword ptr ss:[ebp-0x14]
005B437F    call 0x0052C1C0                                 ; => [ Call: sub_52c1c0 ]
005B4384    push 0x00
005B4386    push 0x00
005B4388    call 0x0069DF2B                                 ; => [ Call: sub_69df2b | Call: nullptr ]
