// ============================================================
// 函数名称: sub_610060
// 起始地址: 0x610060
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00610060    push esi
00610061    mov esi, ecx
00610063    call 0x00610080                                 ; => [ Call: sub_610080 ]
00610068    test byte ptr ss:[esp+0x08], 0x01
0061006D    jz 0x00610078
0061006F    push esi
00610070    call 0x0069AD76                                 ; => [ Call: j__free ]
00610075    add esp, 0x04
00610078    mov eax, esi
0061007A    pop esi
0061007B    ret 0x04
