// ============================================================
// 函数名称: sub_467afa
// 起始地址: 0x467afa
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00467AFA    mov ecx, dword ptr ss:[ebp-0x14]
00467AFD    call 0x0045D550                                 ; => [ Call: sub_45d550 ]
00467B02    push 0x00
00467B04    push 0x00
00467B06    call 0x0069DF2B                                 ; => [ Call: sub_69df2b | Call: nullptr ]
