// ============================================================
// 函数名称: sub_5e07e0
// 起始地址: 0x5e07e0
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

005E07E0    cmp dword ptr ds:[0x0075D534], 0x00
005E07E7    jnz 0x005E07EC                                  ; => [ Data: data_75d534 ]
005E07E9    xor eax, eax
005E07EB    ret
005E07EC    push ecx
005E07ED    call 0x006203F0
005E07F2    ret                                             ; => [ Call: sub_6203f0 ]
