// ============================================================
// 函数名称: sub_697780
// 起始地址: 0x697780
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00697780    push esi
00697781    mov esi, ecx
00697783    call 0x006977A0                                 ; => [ Call: sub_6977a0 ]
00697788    test byte ptr ss:[esp+0x08], 0x01
0069778D    jz 0x00697798
0069778F    push esi
00697790    call 0x0069AD76                                 ; => [ Call: j__free ]
00697795    add esp, 0x04
00697798    mov eax, esi
0069779A    pop esi
0069779B    ret 0x04
