// ============================================================
// 函数名称: sub_410671
// 起始地址: 0x410671
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00410671    push dword ptr ss:[ebp-0x14]
00410674    call 0x0069AD76                                 ; => [ Call: j__free ]
00410679    add esp, 0x04
0041067C    push 0x00
0041067E    push 0x00
00410680    call 0x0069DF2B                                 ; => [ Call: sub_69df2b | Call: nullptr ]
