// ============================================================
// 函数名称: sub_522740
// 起始地址: 0x522740
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00522740    push esi
00522741    mov esi, ecx
00522743    call 0x00522760                                 ; => [ Call: sub_522760 ]
00522748    test byte ptr ss:[esp+0x08], 0x01
0052274D    jz 0x00522758
0052274F    push esi
00522750    call 0x0069AD76                                 ; => [ Call: j__free ]
00522755    add esp, 0x04
00522758    mov eax, esi
0052275A    pop esi
0052275B    ret 0x04
