// ============================================================
// 函数名称: sub_485370
// 起始地址: 0x485370
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00485370    push esi
00485371    mov esi, ecx
00485373    cmp byte ptr ds:[esi+0x24], 0x00
00485377    jnz 0x00485386
00485379    push ecx
0048537A    lea ecx, ds:[esi+0x04]
0048537D    call 0x004856C0                                 ; => [ Call: sub_4856c0 ]
00485382    mov byte ptr ds:[esi+0x24], 0x01
00485386    pop esi
00485387    ret 0x04
