// ============================================================
// 函数名称: sub_687940
// 起始地址: 0x687940
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00687940    push esi
00687941    mov esi, ecx
00687943    call 0x00687960                                 ; => [ Call: sub_687960 ]
00687948    test byte ptr ss:[esp+0x08], 0x01
0068794D    jz 0x00687958
0068794F    push esi
00687950    call 0x0069AD76                                 ; => [ Call: j__free ]
00687955    add esp, 0x04
00687958    mov eax, esi
0068795A    pop esi
0068795B    ret 0x04
