// ============================================================
// 函数名称: sub_524480
// 起始地址: 0x524480
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00524480    push esi
00524481    mov esi, ecx
00524483    call 0x005244A0                                 ; => [ Call: sub_5244a0 ]
00524488    test byte ptr ss:[esp+0x08], 0x01
0052448D    jz 0x00524498
0052448F    push esi
00524490    call 0x0069AD76                                 ; => [ Call: j__free ]
00524495    add esp, 0x04
00524498    mov eax, esi
0052449A    pop esi
0052449B    ret 0x04
