// ============================================================
// 函数名称: sub_401710
// 起始地址: 0x401710
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00401710    push 0x00
00401712    push 0x6DA5D6
00401717    mov ecx, 0x74F824
0040171C    call 0x00402110                                 ; => [ Data: data_74f824 | Call: nullptr | Call: sub_402110 ]
00401721    push 0x6D28C0
00401726    call 0x0069AD3F
0040172B    pop ecx
0040172C    ret                                             ; => [ Call: sub_6d28c0 | Call: _atexit ]
