// ============================================================
// 函数名称: sub_526990
// 起始地址: 0x526990
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00526990    push esi
00526991    mov esi, ecx
00526993    call 0x005269B0                                 ; => [ Call: sub_5269b0 ]
00526998    test byte ptr ss:[esp+0x08], 0x01
0052699D    jz 0x005269A8
0052699F    push esi
005269A0    call 0x0069AD76                                 ; => [ Call: j__free ]
005269A5    add esp, 0x04
005269A8    mov eax, esi
005269AA    pop esi
005269AB    ret 0x04
