// ============================================================
// 函数名称: sub_401730
// 起始地址: 0x401730
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00401730    push 0x00
00401732    push 0x6DA5DE
00401737    mov ecx, 0x74F86C
0040173C    call 0x00402110                                 ; => [ Data: data_74f86c | Call: sub_402110 | Call: nullptr ]
00401741    push 0x6D2920
00401746    call 0x0069AD3F
0040174B    pop ecx
0040174C    ret                                             ; => [ Call: sub_6d2920 | Call: _atexit ]
