// ============================================================
// 函数名称: sub_401590
// 起始地址: 0x401590
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00401590    push 0x00
00401592    push 0x6DA262
00401597    mov ecx, 0x74F704
0040159C    call 0x00402110                                 ; => [ Data: data_74f704 | String: ,\n\n} | Call: nullptr | Call: sub_402110 ]
004015A1    push 0x6D2440
004015A6    call 0x0069AD3F
004015AB    pop ecx
004015AC    ret                                             ; => [ Call: sub_6d2440 | Call: _atexit ]
