// ============================================================
// 函数名称: sub_401470
// 起始地址: 0x401470
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00401470    push 0x00
00401472    push 0x6DA246
00401477    mov ecx, 0x74F65C
0040147C    call 0x00402110                                 ; => [ Data: data_74f65c | Call: sub_402110 | Call: nullptr ]
00401481    push 0x6D20E0
00401486    call 0x0069AD3F
0040148B    pop ecx
0040148C    ret                                             ; => [ Call: sub_6d20e0 | Call: _atexit ]
