// ============================================================
// 函数名称: sub_5866fc
// 起始地址: 0x5866fc
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

005866FC    mov ecx, dword ptr ss:[ebp-0x14]
005866FF    call 0x0051DEF0                                 ; => [ Call: sub_51def0 ]
00586704    push 0x00
00586706    push 0x00
00586708    call 0x0069DF2B                                 ; => [ Call: sub_69df2b | Call: nullptr ]
