// ============================================================
// 函数名称: sub_464940
// 起始地址: 0x464940
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00464940    push ecx
00464941    lea edx, ds:[ecx+0x2C]
00464944    mov dword ptr ss:[esp], 0x00
0046494B    mov ecx, dword ptr ss:[esp+0x08]
0046494F    call 0x004591C0                                 ; => [ Call: sub_4591c0 ]
00464954    mov eax, dword ptr ss:[esp+0x08]
00464958    pop ecx
00464959    ret 0x04
