// ============================================================
// 函数名称: sub_459430
// 起始地址: 0x459430
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00459430    push esi
00459431    mov esi, ecx
00459433    call 0x00459450                                 ; => [ Call: sub_459450 ]
00459438    test byte ptr ss:[esp+0x08], 0x01
0045943D    jz 0x00459448
0045943F    push esi
00459440    call 0x0069AD76                                 ; => [ Call: j__free ]
00459445    add esp, 0x04
00459448    mov eax, esi
0045944A    pop esi
0045944B    ret 0x04
