// ============================================================
// 函数名称: sub_4014f0
// 起始地址: 0x4014f0
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

004014F0    push 0x00
004014F2    push 0x6DA252
004014F7    mov ecx, 0x74F6BC
004014FC    call 0x00402110                                 ; => [ Data: data_74f6bc | Call: nullptr | Call: sub_402110 ]
00401501    push 0x6D2260
00401506    call 0x0069AD3F
0040150B    pop ecx
0040150C    ret                                             ; => [ Call: sub_6d2260 | Call: _atexit ]
