// ============================================================
// 函数名称: sub_449370
// 起始地址: 0x449370
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00449370    push esi
00449371    mov esi, ecx
00449373    call 0x00449440                                 ; => [ Call: sub_449440 ]
00449378    push dword ptr ds:[esi]
0044937A    call 0x0069AD76
0044937F    add esp, 0x04
00449382    pop esi
00449383    ret                                             ; => [ Call: j__free ]
